our_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "his is not dark"], ["updated_at", "2019-04-30 20:57:27.503571"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update_attributes(cat_params)